# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

Include the relevant imports, then connect to the database located at `data.sqlite`.

In [2]:
# Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect("data.sqlite")

## Employees and Their Offices (a One-to-One Join)

Select all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [5]:
# Your code here
com = """
SELECT employees.firstName, employees.lastName, offices.city,offices.state 
FROM employees
JOIN offices
    USING(officeCode);
    
"""

pd.read_sql(com, conn)

   firstName   lastName           city       state
0      Diane     Murphy  San Francisco          CA
1       Mary  Patterson  San Francisco          CA
2       Jeff   Firrelli  San Francisco          CA
3    William  Patterson         Sydney
4     Gerard     Bondur          Paris
5    Anthony        Bow  San Francisco          CA
6     Leslie   Jennings  San Francisco          CA
7     Leslie   Thompson  San Francisco          CA
8      Julie   Firrelli         Boston          MA
9      Steve  Patterson         Boston          MA
10  Foon Yue      Tseng            NYC          NY
11    George     Vanauf            NYC          NY
12      Loui     Bondur          Paris
13    Gerard  Hernandez          Paris
14    Pamela   Castillo          Paris
15     Larry       Bott         London
16     Barry      Jones         London
17      Andy     Fixter         Sydney
18     Peter      Marsh         Sydney
19       Tom       King         Sydney
20      Mami      Nishi          Tokyo  Chiyoda-Ku
21   Yoshimi       Kato          Tokyo  Chiyoda-Ku
22    Martin     Gerard          Paris

## Customers and Their Orders (a One-to-Many Join)

Select all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [10]:
# Your code here
com = """
SELECT customers.contactLastName, customers.contactFirstName, orders.orderNumber, orders.orderDate, orders.status 
FROM employees
JOIN offices
    USING(officeCode),
    customers
    ON employees.employeeNumber = customers.salesRepEmployeeNumber,
    orders
    USING(customerNumber)
LIMIT 10 
"""

pd.read_sql(com, conn)

  contactLastName contactFirstName  orderNumber   orderDate   status
0          Nelson            Susan        10113  2003-03-26  Shipped
1          Nelson            Susan        10135  2003-07-02  Shipped
2          Nelson            Susan        10142  2003-08-08  Shipped
3          Nelson            Susan        10182  2003-11-12  Shipped
4          Nelson            Susan        10229  2004-03-11  Shipped
5          Nelson            Susan        10271  2004-07-20  Shipped
6          Nelson            Susan        10282  2004-08-20  Shipped
7          Nelson            Susan        10312  2004-10-21  Shipped
8          Nelson            Susan        10335  2004-11-19  Shipped
9          Nelson            Susan        10357  2004-12-10  Shipped

## Customers and Their Payments (Another One-to-Many Join)

Select all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [14]:
# Your code here

com = """
SELECT customers.contactLastName, customers.contactFirstName, orders.orderNumber, payments.amount, payments.paymentDate 
FROM employees
JOIN offices
    USING(officeCode),
    customers
    ON employees.employeeNumber = customers.salesRepEmployeeNumber,
    orders
    USING(customerNumber),
    payments
    USING(customerNumber)
LIMIT 20
"""

pd.read_sql(com, conn)

   contactLastName contactFirstName  orderNumber     amount paymentDate
0           Nelson            Susan        10113   11044.30  2003-04-11
1           Nelson            Susan        10113  111654.40  2003-08-15
2           Nelson            Susan        10113   45084.38  2003-11-25
3           Nelson            Susan        10113   43369.30  2004-03-26
4           Nelson            Susan        10113   85410.87  2004-08-28
5           Nelson            Susan        10113   55639.66  2004-11-02
6           Nelson            Susan        10113   47142.70  2004-12-27
7           Nelson            Susan        10113  101244.59  2005-03-05
8           Nelson            Susan        10113   83598.04  2005-04-16
9           Nelson            Susan        10135   11044.30  2003-04-11
10          Nelson            Susan        10135  111654.40  2003-08-15
11          Nelson            Susan        10135   45084.38  2003-11-25
12          Nelson            Susan        10135   43369.30  2004-03-26
13          Nelson            Susan        10135   85410.87  2004-08-28
14          Nelson            Susan        10135   55639.66  2004-11-02
15          Nelson            Susan        10135   47142.70  2004-12-27
16          Nelson            Susan        10135  101244.59  2005-03-05
17          Nelson            Susan        10135   83598.04  2005-04-16
18          Nelson            Susan        10142   11044.30  2003-04-11
19          Nelson            Susan        10142  111654.40  2003-08-15

## Orders, Order Details, and Product Details (a Many-to-Many Join)

Select all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [17]:
# Your code here


com = """
SELECT customers.contactLastName, customers.contactFirstName, orders.orderNumber, orders.orderDate, products.productName, orderdetails.quantityOrdered
FROM employees
JOIN offices
    USING(officeCode),
    customers
    ON employees.employeeNumber = customers.salesRepEmployeeNumber,
    orders
    USING(customerNumber),
    payments
    USING(customerNumber),
    orderdetails
    USING(orderNumber),
    products
    USING(productCode)
ORDER BY orders.orderDate DESC
LIMIT 40
"""

pd.read_sql(com, conn)

,contactLastName,contactFirstName,orderNumber,orderDate,productName,quantityOrdered
0,Labrune,Janine,10425,2005-05-31,1962 LanciaA Delta 16V,38
1,Labrune,Janine,10425,2005-05-31,1957 Chevy Pickup,33
2,Labrune,Janine,10425,2005-05-31,1998 Chrysler Plymouth Prowler,28
3,Labrune,Janine,10425,2005-05-31,1964 Mercedes Tour Bus,38
4,Labrune,Janine,10425,2005-05-31,1926 Ford Fire Engine,19
5,Labrune,Janine,10425,2005-05-31,1992 Ferrari 360 Spider red,28
6,Labrune,Janine,10425,2005-05-31,1940s Ford truck,38
7,Labrune,Janine,10425,2005-05-31,1970 Dodge Coronet,55
8,Labrune,Janine,10425,2005-05-31,1962 Volkswagen Microbus,49
9,Labrune,Janine,10425,2005-05-31,1958 Chevy Corvette Limited Edition,31
10,Labrune,Janine,10425,2005-05-31,1980’s GM Manhattan Express,41
11,Labrune,Janine,10425,2005-05-31,1954 Greyhound Scenicruiser,11
12,Labrune,Janine,10425,2005-05-31,Diamond T620 Semi-Skirted Tanker,18
13,Labrune,Janine,10425,2005-05-31,1962 LanciaA Delta 16V,38
14,Labrune,Janine,10425,2005-05-31,1957 Chevy Pickup,33
15,Labrune,Janine,10425,2005-05-31,1998 Chrysler Plymouth Prowler,28
16,Labrune,Janine,10425,2005-05-31,1964 Mercedes Tour Bus,38
17,Labrune,Janine,10425,2005-05-31,1926 Ford Fire Engine,19
18,Labrune,Janine,10425,2005-05-31,1992 Ferrari 360 Spider red,28
19,Labrune,Janine,10425,2005-05-31,1940s Ford truck,38
20,Labrune,Janine,10425,2005-05-31,1970 Dodge Coronet,55
21,Labrune,Janine,10425,2005-05-31,1962 Volkswagen Microbus,49
22,Labrune,Janine,10425,2005-05-31,1958 Chevy Corvette Limited Edition,31
23,Labrune,Janine,10425,2005-05-31,1980’s GM Manhattan Express,41
24,Labrune,Janine,10425,2005-05-31,1954 Greyhound Scenicruiser,11
25,Labrune,Janine,10425,2005-05-31,Diamond T620 Semi-Skirted Tanker,18
26,Labrune,Janine,10425,2005-05-31,1962 LanciaA Delta 16V,38
27,Labrune,Janine,10425,2005-05-31,1957 Chevy Pickup,33
28,Labrune,Janine,10425,2005-05-31,1998 Chrysler Plymouth Prowler,28
29,Labrune,Janine,10425,2005-05-31,1964 Mercedes Tour Bus,38
30,Labrune,Janine,10425,2005-05-31,1926 Ford Fire Engine,19
31,Labrune,Janine,10425,2005-05-31,1992 Ferrari 360 Spider red,28
32,Labrune,Janine,10425,2005-05-31,1940s Ford truck,38
33,Labrune,Janine,10425,2005-05-31,1970 Dodge Coronet,55
34,Labrune,Janine,10425,2005-05-31,1962 Volkswagen Microbus,49
35,Labrune,Janine,10425,2005-05-31,1958 Chevy Corvette Limited Edition,31
36,Labrune,Janine,10425,2005-05-31,1980’s GM Manhattan Express,41
37,Labrune,Janine,10425,2005-05-31,1954 Greyhound Scenicruiser,11
38,Labrune,Janine,10425,2005-05-31,Diamond T620 Semi-Skirted Tanker,18
39,Freyre,Diego,10424,2005-05-31,1952 Alpine Renault 1300,50

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!